Repository: django-roles-access/master
Catalog: django_roles_access/locale/*/LC_MESSAGES/django.po
Languages: es

source: Public
es: Público

source: Authorized
es: Autorizado

source: By role
es: Por rol

source: View name to be secured: <em>namespace:view_name</em>
es: Vista a ser asegurada: <em>nombredeespacios:nombre_vista</em>

source: View
es: Vista

source: Type of access for the view. Select from available options.
es: Tipo de acceso para la vista. Seleccione de las opciones disponibles.

source: Type
es: Tipo

source: Select the groups (roles) with view access if access type = By role.
es: Seleccione grupos (roles) con acceso a la vista si el tipo = Por rol.

source: View access
es: Acceso a vista

source: Views access
es: Accesos a vistas

source: Unique between all applications.Flag is used with template tag check_role to restrict access in templates.
es: El valor será único entre todas las aplicaciones. Bandera es usado junto con el marcador check_role para restringir el acceso en plantillas.

source: Flag
es: Bandera

source: Select the groups (roles) with access with check_role template tag and flag.
es: Seleccione grupos (roles) con acceso a través del marcador de plantilla check_role y la bandera.

source: Template access
es: Acceso a plantilla

source: Templates access
es: Accesos a plantillas

source: <h1>403 Forbidden</h1>
es: <h1>403 Prohibido</h1>

source: Undefined app
es: Aplicación sin definir

source: WARNING: View belongs to an application of type "NOT_SECURED". No access is checked at all.
es: ALERTA: La vista pertenece a una aplicación de tipo "NOT_SECURED". Ningún acceso será verificado.

source: No security configured for the view (ViewAccess object) and application type is "SECURED". User is required to be authenticated to access the view.
es: No hay seguridad configurada para la vista (objeto ViewAccess) y el tipo de aplicación es "SECURED". Será requerido que el usuario esté autenticado para acceder a la vista

source: No security configured for the view (ViewAccess object) and application type is "PUBLIC". Anonymous user can access the view.
es: No hay seguridad configurada para la vista (objeto ViewAccess) y el tipo de aplicación es "PUBLIC". Usuarios anónimos tendrán acceso a la vista.

source: ERROR: Django roles access middleware is active; or view is protected with Django roles decorator or mixin, and has no application or application has no type. There are no View Access object for the view. Is not possible to determine behavior for access view. Access to view is determined by view implementation.
es: ERROR: El middleware de Django roles access está activo; o la vista está protegida por el mixin o el decorador de Django roles acccess, no hay aplicación o la aplicación no tiene tipo. No hay objeto ViewAccess para la vista. No es posible determinar el comportamiento para el acceso a la vista. El acceso a la vista está determinado por su implementación.

source: Roles with access:
es: Roles con acceso:

source: ERROR: No roles configured to access de view.
es: ERROR: No hay roles configurados para acceder a la vista.

source: No Django roles access tool used. Access to view depends on its implementation.
es: No se han utilizado herramientas de Django roles access. El acceso a la vista dependerá de su implementación

source: View access is of type {}.
es: El acceso a la vista es de tipo {}.

source: ERROR: View access object exist for the view, but no Django role access tool is used: neither decorator, mixin, or middleware.
es: ERROR: Existe un objeto ViewAccess para la vista pero ninguna herramienta (decorador, mixin, o middleware) de Django roles access está siendo usada.

source: Start checking views access. Start gathering information.
es: Comienzo de chequeo de accesos a vistas. Comienzo de recuperación de información.

source: Django roles access middleware is active:
es: El middleware de Django roles access está activo para el sitio:

source: Finish gathering information.
es: Terminada etapa para recopilar información.

source: App Name,Type,View Name,Url,Status,Status description
es: Nombre de apl.,Tipo,Nombre de Vista,Url,Estado,Descripción de estado

source: Reported: {}
es: Informado: {}

source: Analyzing: {}
es: Analizando: {}

source: {} has no type.
es: {} no tiene tipo.

source: {} is {} type.
es: {} es de tipo {}.

source: {} does not have configured views.
es: {} no tiene vistas configuradas.

source: Analysis for view: {}
es: Análisis para la vista: {}

source: View url: {}
es: Url de la vista: {}

source: Finish analyzing {}.
es: Finalizado el análisis de {}

source: End checking view access.
es: Fin de la verificación del acceso a vistas.
